In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {'Surname': ['Ivanov', 'Petrov', 'Sidorov', 'Ivanova', 'Karpov', 'Hill', 'Boni', 'Mitchell', 'Onio', 'Lavrov'],
        'age': [42, 33, 55, np.nan, 65, 23, 25, np.nan, 27, 37],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

In [4]:
labels = [1,2, ...]

In [5]:
#0. Создать датафрейм.
df = pd.DataFrame(data)
print(df)

    Surname   age  visits priority
0    Ivanov  42.0       1      yes
1    Petrov  33.0       3      yes
2   Sidorov  55.0       2       no
3   Ivanova   NaN       3      yes
4    Karpov  65.0       2       no
5      Hill  23.0       3       no
6      Boni  25.0       1       no
7  Mitchell   NaN       1      yes
8      Onio  27.0       2       no
9    Lavrov  37.0       1       no

In [6]:
#1. Вывести информацию о датафрейме.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Surname   10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

In [7]:
#2. Вернуть первые 3 строки DataFrame df
df.head(3)

   Surname   age  visits priority
0   Ivanov  42.0       1      yes
1   Petrov  33.0       3      yes
2  Sidorov  55.0       2       no

In [8]:
#3. Выберите только столбцы 'Surname' и 'age' из DataFrame df.

print(df[df.columns[0:2]])

    Surname   age
0    Ivanov  42.0
1    Petrov  33.0
2   Sidorov  55.0
3   Ivanova   NaN
4    Karpov  65.0
5      Hill  23.0
6      Boni  25.0
7  Mitchell   NaN
8      Onio  27.0
9    Lavrov  37.0

In [9]:
#4. Выберите данные в строках [3, 4, 8] и в столбцах ['Surname', 'age'].

df.iloc[[3, 4, 8]]

   Surname   age  visits priority
3  Ivanova   NaN       3      yes
4   Karpov  65.0       2       no
8     Onio  27.0       2       no

In [10]:
#5. Выберите строки где количество посещений банка больше 3.
df.loc[df['visits'] > 3]

Empty DataFrame
Columns: [Surname, age, visits, priority]
Index: []

In [11]:
#6. Выберите строки, в которых отсутствует возраст.
df.loc[df['age'] > 0]

   Surname   age  visits priority
0   Ivanov  42.0       1      yes
1   Petrov  33.0       3      yes
2  Sidorov  55.0       2       no
4   Karpov  65.0       2       no
5     Hill  23.0       3       no
6     Boni  25.0       1       no
8     Onio  27.0       2       no
9   Lavrov  37.0       1       no

In [12]:
#7. Выберите строки, в которых клиент был больше 2х раз в банке и возраст составляет более 30 лет.
df.loc[(df['visits'] > 2) & (df['age'] > 30)]

  Surname   age  visits priority
1  Petrov  33.0       3      yes

In [13]:

#8. Выберите строки в которых возраст от 55 до 65 (включительно).
df.loc[(df['age'] > 54) & (df['age'] < 66)]

   Surname   age  visits priority
2  Sidorov  55.0       2       no
4   Karpov  65.0       2       no

In [14]:
#9. Измените возраст в строке '4' на 44.

df.at[4, 'age'] = 44
df

    Surname   age  visits priority
0    Ivanov  42.0       1      yes
1    Petrov  33.0       3      yes
2   Sidorov  55.0       2       no
3   Ivanova   NaN       3      yes
4    Karpov  44.0       2       no
5      Hill  23.0       3       no
6      Boni  25.0       1       no
7  Mitchell   NaN       1      yes
8      Onio  27.0       2       no
9    Lavrov  37.0       1       no

In [15]:

#11. Расчитайте средний возраст клиентов
df['age'].mean()

35.75

In [19]:
#12. Добавьте новую строку k к df со значениями по вашему желанию. Затем удалите ее.
k = {'Surname':'Zaripov', 'age':'30', 'visits':'1', 'priority':'yes'}
df = df.append(k, ignore_index=True)
df

     Surname  age visits priority
0     Ivanov   42      1      yes
1     Petrov   33      3      yes
2    Sidorov   55      2       no
3    Ivanova  NaN      3      yes
4     Karpov   44      2       no
5       Hill   23      3       no
6       Boni   25      1       no
7   Mitchell  NaN      1      yes
8       Onio   27      2       no
9     Lavrov   37      1       no
10   Zaripov   30      1      yes